app/views/devise/registrations/edit.html.erb

SELECT "locations".* FROM "locations"
---
  <div class='location'>
    <%= f.collection_select :location_id, Location.all, :id, :city, {},
        {:multiple => false} %></div>

SELECT "languages".* FROM "languages"
---
  <%= f.label :languages %><br />
    <%= f.collection_select :language_ids, Language.all, :id, :language, {},
        {:multiple => true} %>