app/views/devise/registrations/new.html.erb

SELECT "locations".* FROM "locations"
---
  <div class='location'>
    <%= f.collection_select :location_id, Location.all, :id, :city, {},
        {:multiple => false} %>

SELECT "languages".* FROM "languages"
---

    <%= f.collection_select :language_ids, Language.all, :id, :language, {},
        {:multiple => true} %>