app/controllers/guides_controller.rb

  def index #listing of the following items
    #@guides = User.all

    @guides = User.where(isguide: true)
---
SELECT "users".* FROM "users"  WHERE "users"."isguide" IS NULL

  def show

    user_id  = params[:id]
    commenter_id = params[:commenter_id]
    @g = User.find(user_id)
    @c = User.all


    if user_id.blank?
      @post = Comment.all
    else
      @post = Comment.where(user_id: user_id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users"
SELECT  "comments".* FROM "comments"  WHERE "comments"."user_id" = 1 LIMIT 1

  def comment
    if user_signed_in?
      user_id = params[:user_id]
      comments = Comment.new
      comments.title = params[:title]
      comments.content = params[:content]
      comments.user_id = user_id
      comments.commenter_id = User.current.id


      if comments.save
---
INSERT INTO "comments" ("commenter_id", "content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["commenter_id", 2], ["content", "g"], ["created_at", "2014-07-12 18:58:28.176748"], ["title", "u"], ["updated_at", "2014-07-12 18:58:28.176748"], ["user_id", 1]]

  def create

    guides = Guides.new
    guides.name = params[:name] #parameter/value name of html username
    guides.location = params[:location]
    guides.description = params[:description]
    flash.now[:notice] = guides.name
    #if the bottom returns false, it cannot be saved
    if guides.save
---
INSERT INTO "guides" ("created_at", "description", "location", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-07 06:35:34.915546"], ["description", "Will show you old buildings"], ["location", "Hong Kong"], ["name", "Nathan"], ["updated_at", "2014-07-07 06:35:34.915546"]]

  def locations
    if params[:location] != ""
      @y = (Location.find_by city: params[:location]).users
---
SELECT  "locations".* FROM "locations"  WHERE "locations"."city" = 'Hong Kong' LIMIT 1