app/controllers/registrations_controller.rb

SELECT "locations".* FROM "locations"
INSERT INTO "users" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "description", "email", "encrypted_password", "firstname", "isguide", "languages", "location", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "languages".* FROM "languages" INNER JOIN "languages_users" ON "languages"."id" = "languages_users"."language_id" WHERE "languages_users"."user_id" = ?  [["user_id", 5]]
---
  def create

    @loc = Location.all
    super
    params[:newlanguage]
    language_ids = params[:user][:language_ids] #grab IDS
    language_ids.each do |id|
      @user.languages << Language.find(id) unless id.blank?

SELECT "languages".id FROM "languages" INNER JOIN "languages_users" ON "languages"."id" = "languages_users"."language_id" WHERE "languages_users"."user_id" = ?  [["user_id", 1]]
---
  def update
    super

    language_ids = params[:user][:language_ids] #grab IDS
    language_ids.each do |id|
      @user.languages << Language.find(id) unless id.blank?

SELECT "locations".* FROM "locations"
---
  def new
    @loc = Location.all