app/controllers/site_controller.rb

SELECT "locations".* FROM "locations"
SELECT  "users".* FROM "users"  WHERE "users"."isguide" = 't' AND "users"."location_id" = 1 AND "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def index #listing of the following items
    @locations = Location.all
    @g = []

    # Only 4 guides are to be shown in the map box at a time
    # the following function randomizes the photos of guides that appear in the map box
    @locations.each do |i| #loop through guides in each location
      guide_loc = User.where(isguide: true, location_id: i)

SELECT "users".* FROM "users"  WHERE "users"."isguide" = 't'
---
  def location
    @guides = User.where(isguide: true)